
export const au=149597870700;//Астрономическая единица в метрах
export const G=6.674301e-11/(au**3);//Универсальная гравитационная постоянная  (м3·с−2·кг−1) выраженная через астрономические единицы
export const dt=3600//Шаг диффиренцирования в секундах

export const mSun=1.98892e+30; //масса Солнца в кг

export const mEarth=5.9742e+24; //Масса Земли в кг
export const vEarth=29765 / au; //Скорость Земли а.е./с

export const mMoon=7.36e+22; //Масса Луны в кг
export const vMoon=1020/au; //Скорость движения Луны вокруг Земли в а.е./с
export const rMoon=384400*1000/au; //Расстояние между Луной и Землёй